In [15]:
import pandas as pd
import numpy as csv
import random

In [99]:
data = pd.read_csv('ph_gj.csv')
data.head(5)

,Textbox124,district_name,AS_,SrAc_,HAc_,MAc_,SlAc_,N_,MAl_,SlAl_
0,1,Ahmadabad,17.65,0.00,0.0,0.42,3.00,2.17,76.61,0.15
1,2,Amreli,0.01,0.00,0.0,0.19,6.02,3.33,90.17,0.29
2,3,Anand,88.83,0.00,0.0,0.11,0.41,0.41,10.07,0.17
3,4,Aravalli,0.59,0.03,0.0,0.54,2.72,0.77,94.35,1.01
4,5,Banas Kantha,0.26,0.00,0.0,0.11,0.97,0.78,97.44,0.44

In [100]:
data_1 = data.drop(['Textbox124','district_name'], axis = 1)

In [101]:
data_1.head()

     AS_  SrAc_  HAc_  MAc_  SlAc_    N_   MAl_  SlAl_
0  17.65   0.00   0.0  0.42   3.00  2.17  76.61   0.15
1   0.01   0.00   0.0  0.19   6.02  3.33  90.17   0.29
2  88.83   0.00   0.0  0.11   0.41  0.41  10.07   0.17
3   0.59   0.03   0.0  0.54   2.72  0.77  94.35   1.01
4   0.26   0.00   0.0  0.11   0.97  0.78  97.44   0.44

In [102]:
data['type'] = data_1.idxmax(axis=1)

In [103]:
data = data[['district_name','type']]
data.head(5)

  district_name  type
0     Ahmadabad  MAl_
1        Amreli  MAl_
2         Anand   AS_
3      Aravalli  MAl_
4  Banas Kantha  MAl_

In [104]:
dictionary = {'AS_' : 'Acid Sulphate', 'SrAc_': 'Strongly acidic', 'HAc_' : 'Highly Acidic', 'MAc_' : 'Moderately Acidic', 'SlAc_' : 'Slightly Acidic', 'N_' : 'Neutral', 'MAl_' : 'Moderately Alkaline', 'SlAl_' : 'Strongly Alkaline'}

In [105]:
def getph(type):
    return dictionary[type]

In [106]:
data['pH'] = data['type'].apply(getph)

In [107]:
data = data[['district_name','pH']]
data.head()

  district_name                   pH
0     Ahmadabad  Moderately Alkaline
1        Amreli  Moderately Alkaline
2         Anand        Acid Sulphate
3      Aravalli  Moderately Alkaline
4  Banas Kantha  Moderately Alkaline

In [108]:
data.to_csv('ph_gj.csv', index = False)

In [109]:
data = pd.read_csv('ph_gj.csv')
data.head(5)

  district_name                   pH
0     Ahmadabad  Moderately Alkaline
1        Amreli  Moderately Alkaline
2         Anand        Acid Sulphate
3      Aravalli  Moderately Alkaline
4  Banas Kantha  Moderately Alkaline

In [110]:
ph = {'Acid Sulphate': [1,3.5], 'Strongly acidic': [3.6, 4.4], 'Highly Acidic':[4.5,5.0], 'Moderately Acidic': [5.1,5.9], 'Slightly Acidic': [5.9,6.5], 'Neutral':[6.6,7.3], 'Moderately Alkaline': [7.4,8.2], 'Strongly Alkaline': [8.2,13]}

In [111]:
ph['Slightly Acidic'][0]

5.9

In [112]:
def getrange(data):
    return round(random.uniform(ph[data][0], ph[data][1]), 1)

In [113]:
data['pH'] = data['pH'].apply(getrange)

In [114]:
data.head(5)

  district_name   pH
0     Ahmadabad  7.9
1        Amreli  7.7
2         Anand  3.4
3      Aravalli  8.0
4  Banas Kantha  8.2

In [115]:
data.to_csv('ph_gj.csv', index = False)